Repository: autohotkey-docs-translation/v1-pt-br
Catalog: omegat/project_save.tmx
Source language: en
Languages: pt_br

source: ["Usage and Syntax","",
pt_br: ["Uso e Sintaxe","",

source: ["UseResourceLang directive (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#UseResourceLang",99],
pt_br: ["Diretiva UseResourceLang (Ahk2Exe)","misc/Ahk2ExeDirectives.htm#UseResourceLang",99],

source: ["Using the Program","Program.htm"],
pt_br: ["Usando o Programa","Program.htm"],

source: ["Variables and Expressions","Variables.htm"],
pt_br: ["Variáveis e Expressões","Variables.htm"],

source: ["Wheel hotkeys for mouse","Hotkeys.htm#Wheel"],
pt_br: ["Hotkeys com a roda do mouse","Hotkeys.htm#Wheel"],

source: ["Wheel, simulating rotation","commands/Click.htm"],
pt_br: ["Roda, simular rotação","commands/Click.htm"],

source: ["While-loop","commands/While.htm"]
pt_br: ["Loop com While","commands/While.htm"]

source: ["Winamp automation","misc/Winamp.htm"],
pt_br: ["Automação do Winamp","misc/Winamp.htm"],

source: ["Window Groups","",
pt_br: ["Grupos de Janelas","",

source: ["Window Titles","misc/WinTitle.htm"],
pt_br: ["Títulos de Janelas","misc/WinTitle.htm"],

source: ["Window","",
pt_br: ["Janelas","",

source: ["Write method (File)","objects/File.htm#Write"],
pt_br: ["Método Write (Arquivo)","objects/File.htm#Write"],

source: ["WriteLine method (File)","objects/File.htm#WriteLine"],
pt_br: ["Método WriteLine (Arquivo)","objects/File.htm#WriteLine"],

source: ["WriteNumType method (File)","objects/File.htm#WriteNum"],
pt_br: ["Método WriteNumType (Arquivo)","objects/File.htm#WriteNum"],

source: ["abbreviation expansion","Hotstrings.htm"],
pt_br: ["expansão de abreviatura","Hotstrings.htm"],

source: ["absolute value, abs()","commands/Math.htm#Abs"],
pt_br: ["valor absoluto, módulo, abs()","commands/Math.htm#Abs"],

source: ["activate a window","commands/WinActivate.htm"],
pt_br: ["ativar uma janela","commands/WinActivate.htm"],

source: ["add","commands/EnvAdd.htm"],
pt_br: ["adição","commands/EnvAdd.htm"],

source: ["administrator privileges for scripts","Variables.htm#RequireAdmin"],
pt_br: ["privilégios de administrador para scripts","Variables.htm#RequireAdmin"],

source: ["append to file","commands/FileAppend.htm"],
pt_br: ["acrescentar a um arquivo","commands/FileAppend.htm"],

source: ["assigning values to variables","Variables.htm#AssignOp"],
pt_br: ["atribuindo valores a variáveis","Variables.htm#AssignOp"],

source: ["attributes of files and folders","commands/FileGetAttrib.htm"],
pt_br: ["atributos de arquivos e pastas","commands/FileGetAttrib.htm"],

source: ["auto-execute section","Scripts.htm#auto"],
pt_br: ["seção de execução automática","Scripts.htm#auto"],

source: ["auto-replace text as you type it","Hotstrings.htm"],
pt_br: ["substituir texto automaticamente à medida que é digitado","Hotstrings.htm"],

source: ["balloon tip","commands/TrayTip.htm"],
pt_br: ["Balão de aviso","commands/TrayTip.htm"],

source: ["base (Objects)","Objects.htm#Custom_Objects"],
pt_br: ["base (Objetos)","Objects.htm#Custom_Objects"],

source: ["base property (Object)","objects/Object.htm#Base"],
pt_br: ["propriedade-base (Objeto)","objects/Object.htm#Base"],

source: ["beep the PC speaker","commands/SoundBeep.htm"],
pt_br: ["soar o autofalante do PC","commands/SoundBeep.htm"],

source: ["between (check if var between two values)","commands/IfBetween.htm"],
pt_br: ["between (checar se a variável está entre dois valores)","commands/IfBetween.htm"],

source: ["bitwise operations","Variables.htm#bitwise"],
pt_br: ["operações bit a bit","Variables.htm#bitwise"],

source: ["blind-mode Send","commands/Send.htm#blind"],
pt_br: ["Send em modo cego","commands/Send.htm#blind"],

source: ["blocks (lines enclosed in braces)","commands/Block.htm"],
pt_br: ["blocos (linhas envoltas por chaves)","commands/Block.htm"],

source: ["built-in functions","Functions.htm#BuiltIn"],
pt_br: ["funções nativas","Functions.htm#BuiltIn"],

source: ["built-in variables","Variables.htm#BuiltIn"],
pt_br: ["variáveis nativas","Variables.htm#BuiltIn"],

source: ["button list (mouse and joystick)","KeyList.htm"],
pt_br: ["lista de botões (mouse e joystick)","KeyList.htm"],

source: ["button state","commands/GetKeyState.htm#function"],
pt_br: ["estado de um botão","commands/GetKeyState.htm#function"],

source: ["callbacks","commands/RegisterCallback.htm"],
pt_br: ["Funções de retorno","commands/RegisterCallback.htm"],

source: ["case sensitive strings","commands/StringCaseSense.htm"],
pt_br: ["Strings que diferenciam maiúsculas de minúsculas","commands/StringCaseSense.htm"],

source: ["choose file","commands/FileSelectFile.htm"],
pt_br: ["selecionar um arquivo","commands/FileSelectFile.htm"],

source: ["choose folder","commands/FileSelectFolder.htm"],
pt_br: ["selecionar uma pasta","commands/FileSelectFolder.htm"],

source: ["class (Objects)","Objects.htm#Custom_Classes"],
pt_br: ["classe (Objetos)","Objects.htm#Custom_Classes"],

source: ["class name of a window","commands/WinGetClass.htm"],
pt_br: ["nome de classe de uma janela","commands/WinGetClass.htm"],

source: ["class","Objects.htm#Custom_Classes",5],
pt_br: ["classes","Objects.htm#Custom_Classes",5],

source: ["close a window","commands/WinClose.htm"],
pt_br: ["fechar uma janela","commands/WinClose.htm"],

source: ["color names, RGB/HTML","commands/Progress.htm#colors"],
pt_br: ["nomes das cores, RGB/HTML","commands/Progress.htm#colors"],

source: ["color of pixels","commands/PixelSearch.htm"],
pt_br: ["cor dos píxeis","commands/PixelSearch.htm"],

source: ["comma operator (multi-statement)","Variables.htm#comma"],
pt_br: ["operador “vírgula” (declarações múltiplas)","Variables.htm#comma"],

source: ["command line parameters","Scripts.htm#cmd"],
pt_br: ["Parâmetros da linha de comando","Scripts.htm#cmd"],

source: ["commands, alphabetical list","commands/index.htm"],
pt_br: ["Comandos, lista em ordem alfabética","commands/index.htm"],

source: ["comments in scripts","Language.htm#comments"],
pt_br: ["comentários em scripts","Language.htm#comments"],

source: ["compile a script","Scripts.htm#ahk2exe"],
pt_br: ["compilar um script","Scripts.htm#ahk2exe"],

source: ["concatenate, in expressions","Variables.htm#concat"],
pt_br: ["concatenar, em expressões","Variables.htm#concat"],

source: ["concatenate, script lines","Scripts.htm#continuation"],
pt_br: ["concatenar, linhas do script","Scripts.htm#continuation"],

source: ["concepts and conventions","Concepts.htm"],
pt_br: ["Conceitos e convenções","Concepts.htm"],

source: ["context menu (GUI)","commands/Gui.htm#GuiContextMenu"],
pt_br: ["Menu de contexto (GUI)","commands/Gui.htm#GuiContextMenu"],

source: ["continuation sections","Scripts.htm#continuation"],
pt_br: ["Continuações de seção","Scripts.htm#continuation"],

source: ["control flow","Language.htm#control-flow"],
pt_br: ["Fluxo de controle","Language.htm#control-flow"],

source: ["convert a script to an EXE","Scripts.htm#ahk2exe"],
pt_br: ["converter um script em um EXE","Scripts.htm#ahk2exe"],

source: ["coordinates","commands/CoordMode.htm"],
pt_br: ["coordenadas","commands/CoordMode.htm"],

source: ["copy file","commands/FileCopy.htm"],
pt_br: ["copiar arquivo","commands/FileCopy.htm"],

source: ["copy folder/directory","commands/FileCopyDir.htm"],
pt_br: ["copiar pasta/diretório","commands/FileCopyDir.htm"],

source: ["create file","commands/FileAppend.htm"],
pt_br: ["Criar um arquivo","commands/FileAppend.htm"],

source: ["create folder/directory","commands/FileCreateDir.htm"],
pt_br: ["criar uma pasta/diretório","commands/FileCreateDir.htm"],

source: ["current directory","commands/SetWorkingDir.htm"],
pt_br: ["diretório atual","commands/SetWorkingDir.htm"],

source: ["current thread","misc/Threads.htm"],
pt_br: ["fio de execução (thread) atual","misc/Threads.htm"],

source: ["cursor shape","Variables.htm#Cursor"],
pt_br: ["formato do cursor","Variables.htm#Cursor"],

source: ["custom combination hotkeys","Hotkeys.htm#combo"],
pt_br: ["hotkeys de combinação personalizada de teclas","Hotkeys.htm#combo"],

source: ["dates and times (compare)","commands/EnvSub.htm"],
pt_br: ["datas e horários (comparar)","commands/EnvSub.htm"],

source: ["dates and times (math)","commands/EnvAdd.htm"],
pt_br: ["datas e horários (operações matemáticas)","commands/EnvAdd.htm"],

source: ["dates and times (of files)","commands/FileSetTime.htm"],
pt_br: ["datas e horários (de arquivos)","commands/FileSetTime.htm"],

source: ["debugger","commands/OutputDebug.htm"],
pt_br: ["depurador","commands/OutputDebug.htm"],

source: ["debugging a script","Scripts.htm#debug"],
pt_br: ["depurando um script","Scripts.htm#debug"],

source: ["decimal places","commands/Format.htm"],
pt_br: ["casas decimais","commands/Format.htm"],

source: ["delete files","commands/FileDelete.htm"],
pt_br: ["excluir arquivos","commands/FileDelete.htm"],

source: ["delete folder/directory","commands/FileRemoveDir.htm"],
pt_br: ["excluir uma pasta/diretório","commands/FileRemoveDir.htm"],

source: ["dialog FileSelectFile","commands/FileSelectFile.htm"],
pt_br: ["caixa de diálogo FileSelectFile","commands/FileSelectFile.htm"],

source: ["dialog FileSelectFolder","commands/FileSelectFolder.htm"],
pt_br: ["caixa de diálogo FileSelectFolder","commands/FileSelectFolder.htm"],

source: ["dialog InputBox","commands/InputBox.htm"],
pt_br: ["caixa de diálogo InputBox","commands/InputBox.htm"],

source: ["dialog MsgBox","commands/MsgBox.htm"],
pt_br: ["caixa de diálogo MsgBox","commands/MsgBox.htm"],

source: ["disk space","commands/DriveSpaceFree.htm"],
pt_br: ["espaço em disco","commands/DriveSpaceFree.htm"],

source: ["divide (math)","Variables.htm#divide"],
pt_br: ["dividir (operação matemática)","Variables.htm#divide"],

source: ["double-deref","Language.htm#dynamic-variables"],
pt_br: ["dupla desreferência","Language.htm#dynamic-variables"],

source: ["download a file","commands/URLDownloadToFile.htm"],
pt_br: ["baixar um arquivo","commands/URLDownloadToFile.htm"],

source: ["drag and drop (GUI windows)","commands/Gui.htm#GuiDropFiles"],
pt_br: ["arrastar-e-soltar (janelas de GUI)","commands/Gui.htm#GuiDropFiles"],

source: ["drag the mouse","commands/MouseClickDrag.htm"],
pt_br: ["arrastar o mouse","commands/MouseClickDrag.htm"],

source: ["dynamic function calls","Functions.htm#DynCall"],
pt_br: ["chamadas dinâmicas de função","Functions.htm#DynCall"],

source: ["dynamic variables","Language.htm#dynamic-variables"],
pt_br: ["variáveis dinâmicas","Language.htm#dynamic-variables"],

source: ["environment variables (change them)","commands/EnvSet.htm"],
pt_br: ["variáveis de ambiente (alterá-las)","commands/EnvSet.htm"],

source: ["environment variables","Concepts.htm#environment-variables"],
pt_br: ["variáveis de ambiente","Concepts.htm#environment-variables"],

source: ["escape sequence","misc/EscapeChar.htm"],
pt_br: ["sequência de escape","misc/EscapeChar.htm"],

source: ["expressions","Variables.htm#Expressions"],
pt_br: ["expressões","Variables.htm#Expressions"],

source: ["file attributes","commands/FileSetAttrib.htm"],
pt_br: ["atributos de arquivos","commands/FileSetAttrib.htm"],

source: ["file or folder (does it exist)","commands/IfExist.htm"],
pt_br: ["arquivo ou pasta (determinar se existe)","commands/IfExist.htm"],

source: ["file pattern","commands/LoopFile.htm"],
pt_br: ["padrão de caminho de arquivo","commands/LoopFile.htm"],

source: ["file, creating","commands/FileAppend.htm"],
pt_br: ["arquivo, criar","commands/FileAppend.htm"],

source: ["file, reading","commands/LoopReadFile.htm"],
pt_br: ["arquivo, ler","commands/LoopReadFile.htm"],

source: ["file, writing/appending","commands/FileAppend.htm"],
pt_br: ["arquivo, gravar/acrescentar","commands/FileAppend.htm"],

source: ["find a file","commands/IfExist.htm"],
pt_br: ["encontrar um arquivo","commands/IfExist.htm"],

source: ["find a string","commands/StringGetPos.htm"],
pt_br: ["encontrar uma string","commands/StringGetPos.htm"],

source: ["find a window","commands/WinExist.htm"],
pt_br: ["encontrar uma janela","commands/WinExist.htm"],

source: ["floating point (Format)","commands/Format.htm"],
pt_br: ["ponto flutuante (Format)","commands/Format.htm"],

source: ["floating point (check if it is one)","commands/IfIs.htm"],
pt_br: ["ponto flutuante (verificar se se trata de um)","commands/IfIs.htm"],

source: ["focus","commands/ControlFocus.htm"],
pt_br: ["foco","commands/ControlFocus.htm"],

source: ["folder/directory copy","commands/FileCopyDir.htm"],
pt_br: ["copiar pasta/diretório","commands/FileCopyDir.htm"],

source: ["folder/directory create","commands/FileCreateDir.htm"],
pt_br: ["criar pasta/diretório","commands/FileCreateDir.htm"],

source: ["folder/directory move","commands/FileMoveDir.htm"],
pt_br: ["mover pasta/diretório","commands/FileMoveDir.htm"],

source: ["folder/directory remove","commands/FileRemoveDir.htm"],
pt_br: ["excluir pasta/diretório","commands/FileRemoveDir.htm"],

source: ["folder/directory select","commands/FileSelectFolder.htm"],
pt_br: ["selecionar pasta/diretório","commands/FileSelectFolder.htm"],

source: ["format (defaults)","commands/Format.htm"],
pt_br: ["formatar (padrões)","commands/Format.htm"],

source: ["free space","commands/DriveSpaceFree.htm"],
pt_br: ["espaço livre","commands/DriveSpaceFree.htm"],

source: ["function objects","objects/Functor.htm"],
pt_br: ["Objetos de Função","objects/Functor.htm"],

source: ["functions (defining and calling)","Functions.htm"],
pt_br: ["funções (definindo e chamando)","Functions.htm"],

source: ["functions (libraries)","Functions.htm#lib"],
pt_br: ["funções (bibliotecas)","Functions.htm#lib"],

source: ["g-label (responding to GUI events)","commands/Gui.htm#label"],
pt_br: ["g-label (respondendo a eventos de GUIs)","commands/Gui.htm#label"],

source: ["game automation","commands/PixelSearch.htm"],
pt_br: ["automação de jogos","commands/PixelSearch.htm"],

source: ["global variables in functions","Functions.htm#Global"],
pt_br: ["variáveis globais em funções","Functions.htm#Global"],

source: ["hexadecimal format","commands/Format.htm"],
pt_br: ["formato hexadecimal","commands/Format.htm"],

source: ["hibernate or suspend","commands/Shutdown.htm#Suspend"],
pt_br: ["hibernar ou suspender","commands/Shutdown.htm#Suspend"],

source: ["hidden text","commands/DetectHiddenText.htm"],
pt_br: ["texto oculto","commands/DetectHiddenText.htm"],

source: ["hidden windows","commands/DetectHiddenWindows.htm"],
pt_br: ["janelas ocultas","commands/DetectHiddenWindows.htm"],

source: ["hook","commands/_InstallKeybdHook.htm"],
pt_br: ["gancho","commands/_InstallKeybdHook.htm"],

source: ["icon, changing","commands/Menu.htm#Icon"],
pt_br: ["ícone, alterar","commands/Menu.htm#Icon"],

source: ["infrared remote controls","scripts/index.htm#WinLIRC"],
pt_br: ["controles remotos infravermelhos","scripts/index.htm#WinLIRC"],

source: ["installer options","Program.htm#install"],
pt_br: ["opções do instalador","Program.htm#install"],

source: ["integer (Format)","commands/Format.htm"],
pt_br: ["inteiro (Formato)","commands/Format.htm"],

source: ["integer (check if it is one)","commands/IfIs.htm"],
pt_br: ["inteiro (checar se se trata de um)","commands/IfIs.htm"],

source: ["key list (keyboard, mouse, joystick)","KeyList.htm"],
pt_br: ["lista de teclas (teclado, mouse, joystick)","KeyList.htm"],

source: ["key state","commands/GetKeyState.htm#function"],
pt_br: ["estado de uma tecla","commands/GetKeyState.htm#function"],

source: ["keyboard hook","commands/_InstallKeybdHook.htm"],
pt_br: ["gancho de teclado","commands/_InstallKeybdHook.htm"],

source: ["keystrokes, sending","commands/Send.htm"],
pt_br: ["pressionamentos de teclas, enviar","commands/Send.htm"],

source: ["labels","misc/Labels.htm"],
pt_br: ["rótulos","misc/Labels.htm"],

source: ["language overview","Language.htm"],
pt_br: ["visão geral da linguagem","Language.htm"],

source: ["last found window","misc/WinTitle.htm#LastFoundWindow"],
pt_br: ["última janela encontrada","misc/WinTitle.htm#LastFoundWindow"],

source: ["length of a string","commands/StrLen.htm"],
pt_br: ["comprimento de uma string","commands/StrLen.htm"],

source: ["libraries of functions","Functions.htm#lib"],
pt_br: ["bibliotecas de funções","Functions.htm#lib"],

source: ["license","license.htm"],
pt_br: ["licença","license.htm"],

source: ["line continuation","Scripts.htm#continuation"],
pt_br: ["continuação da linha","Scripts.htm#continuation"],

source: ["lnk (link/shortcut) file","commands/FileCreateShortcut.htm"],
pt_br: ["arquivo lnk (atalho/link)","commands/FileCreateShortcut.htm"],

source: ["local variables","Functions.htm#Local"],
pt_br: ["variáveis locais","Functions.htm#Local"],

source: ["logarithm, log()","commands/Math.htm#Log"],
pt_br: ["logaritmo, log()","commands/Math.htm#Log"],

source: ["long file name (converting to)","commands/LoopFile.htm#LoopFileLongPath"],
pt_br: ["nome longo de arquivo (converter para)","commands/LoopFile.htm#LoopFileLongPath"],

source: ["long paths","misc/LongPaths.htm"],
pt_br: ["caminhos longos","misc/LongPaths.htm"],

source: ["main window","Program.htm#main-window"],
pt_br: ["janela principal","Program.htm#main-window"],

source: ["math functions","commands/Math.htm"],
pt_br: ["funções matemáticas","commands/Math.htm"],

source: ["math operations (expressions)","Variables.htm#Expressions"],
pt_br: ["operações matemáticas (expressões)","Variables.htm#Expressions"],

source: ["message list (WM_*)","misc/SendMessageList.htm"],
pt_br: ["lista de mensagens (WM_*)","misc/SendMessageList.htm"],

source: ["messages, receiving","commands/OnMessage.htm"],
pt_br: ["mensagens, receber","commands/OnMessage.htm"],

source: ["messages, sending","commands/PostMessage.htm"],
pt_br: ["mensagens, enviar","commands/PostMessage.htm"],

source: ["meta-functions (Objects)","Objects.htm#Meta_Functions"],
pt_br: ["metafunções (Objetos)","Objects.htm#Meta_Functions"],

source: ["modal (always on top)","commands/MsgBox.htm"],
pt_br: ["modal (sempre no topo)","commands/MsgBox.htm"],

source: ["modulo, mod()","commands/Math.htm#Mod"],
pt_br: ["resto de uma divisão, mod()","commands/Math.htm#Mod"],

source: ["mouse hook","commands/_InstallMouseHook.htm"],
pt_br: ["gancho de mouse","commands/_InstallMouseHook.htm"],

source: ["mouse speed","commands/SetDefaultMouseSpeed.htm"],
pt_br: ["velocidade do mouse","commands/SetDefaultMouseSpeed.htm"],

source: ["mouse wheel","commands/Click.htm"],
pt_br: ["roda do mouse","commands/Click.htm"],

source: ["move a window","commands/WinMove.htm"],
pt_br: ["mover uma janela","commands/WinMove.htm"],

source: ["move file","commands/FileMove.htm"],
pt_br: ["mover um arquivo","commands/FileMove.htm"],

source: ["move folder/directory","commands/FileMoveDir.htm"],
pt_br: ["mover uma pasta/diretório","commands/FileMoveDir.htm"],

source: ["multiply","commands/EnvMult.htm"],
pt_br: ["multiplicar","commands/EnvMult.htm"],

source: ["mute (changing it)","commands/SoundSet.htm"],
pt_br: ["mutar (alterar)","commands/SoundSet.htm"],

source: ["number format","commands/Format.htm"],
pt_br: ["formato de número","commands/Format.htm"],

source: ["number","commands/IfIs.htm"],
pt_br: ["number (tipo de dados)","commands/IfIs.htm"],

source: ["open file","commands/FileOpen.htm"],
pt_br: ["abrir arquivo","commands/FileOpen.htm"],

source: ["operators in expressions","Variables.htm#Operators"],
pt_br: ["operadoras em expressões","Variables.htm#Operators"],

source: ["parameters passed into a script","Scripts.htm#cmd"],
pt_br: ["parâmetros passados para um script","Scripts.htm#cmd"],

source: ["parse a string (Loop)","commands/LoopParse.htm"],
pt_br: ["analisar uma string (Loop)","commands/LoopParse.htm"],

source: ["parse a string (StrSplit)","commands/StrSplit.htm"],
pt_br: ["analisar uma string (StrSplit)","commands/StrSplit.htm"],

source: ["performance of scripts","misc/Performance.htm"],
pt_br: ["desempenho de scripts","misc/Performance.htm"],

source: ["play a sound or video file","commands/SoundPlay.htm"],
pt_br: ["reproduzir um arquivo de som ou vídeo","commands/SoundPlay.htm"],

source: ["power (exponentiation)","Variables.htm#pow"],
pt_br: ["potência (exponenciação)","Variables.htm#pow"],

source: ["prefix and suffix keys","Hotkeys.htm"],
pt_br: ["teclas de prefixos e sufixos","Hotkeys.htm"],

source: ["print a file","commands/Run.htm"],
pt_br: ["imprimir um arquivo","commands/Run.htm"],

source: ["priority of a process","commands/Process.htm"],
pt_br: ["prioridade de um processo","commands/Process.htm"],

source: ["priority of a thread","commands/Thread.htm"],
pt_br: ["prioridade de um fio de execução","commands/Thread.htm"],

source: ["properties (Objects)","Objects.htm#Custom_Classes_property"],
pt_br: ["propriedades (Objetos)","Objects.htm#Custom_Classes_property"],

source: ["properties of a file or folder","commands/Run.htm"],
pt_br: ["propriedades de um arquivo ou pasta","commands/Run.htm"],

source: ["quit script","commands/ExitApp.htm"],
pt_br: ["sair de um script","commands/ExitApp.htm"],

source: ["raw-mode Send","commands/Send.htm#SendRaw"],
pt_br: ["Send, em modo bruto (raw)","commands/Send.htm#SendRaw"],

source: ["read file","commands/FileRead.htm"],
pt_br: ["ler um arquivo","commands/FileRead.htm"],

source: ["reboot","commands/Shutdown.htm"],
pt_br: ["reiniciar o computador","commands/Shutdown.htm"],

source: ["registry loop","commands/LoopReg.htm"],
pt_br: ["loop no registro","commands/LoopReg.htm"],

source: ["regular expressions:
pt_br: ["expressões regulares:

source: ["remap joystick","misc/RemapJoystick.htm"],
pt_br: ["remapear botões do joystick","misc/RemapJoystick.htm"],

source: ["remap keys or mouse buttons","misc/Remap.htm"],
pt_br: ["remapear teclas e botões do mouse","misc/Remap.htm"],

source: ["remote controls, hand-held","scripts/index.htm#WinLIRC"],
pt_br: ["controles remotos de mão","scripts/index.htm#WinLIRC"],

source: ["remove folder/directory","commands/FileRemoveDir.htm"],
pt_br: ["excluir uma pasta/diretório","commands/FileRemoveDir.htm"],

source: ["rename file","commands/FileMove.htm"],
pt_br: ["renomear um arquivo","commands/FileMove.htm"],

source: ["resize a window","commands/WinMove.htm"],
pt_br: ["redimensionar uma janela","commands/WinMove.htm"],

source: ["restart the computer","commands/Shutdown.htm"],
pt_br: ["reiniciar o computador","commands/Shutdown.htm"],

source: ["rounding a number","commands/Math.htm#Round"],
pt_br: ["arredondar um número","commands/Math.htm#Round"],

source: ["scan code","commands/Send.htm#vk"],
pt_br: ["código de leitura","commands/Send.htm#vk"],

source: ["scientific notation","commands/Format.htm"],
pt_br: ["notação científica","commands/Format.htm"],

source: ["select file","commands/FileSelectFile.htm"],
pt_br: ["Selecionar arquivo","commands/FileSelectFile.htm"],

source: ["select folder","commands/FileSelectFolder.htm"],
pt_br: ["selecionar pasta","commands/FileSelectFolder.htm"],

source: ["sending data between scripts","commands/OnMessage.htm#SendString"],
pt_br: ["Enviar dados entre scripts","commands/OnMessage.htm#SendString"],

source: ["short file name (8.3 format)","commands/LoopFile.htm#LoopFileShortPath"],
pt_br: ["nome curto de arquivo (formato 8.3)","commands/LoopFile.htm#LoopFileShortPath"],

source: ["short-circuit boolean evaluation","Functions.htm#ShortCircuit"],
pt_br: ["avaliação booleana em curto-circuito","Functions.htm#ShortCircuit"],

source: ["shortcut file","commands/FileCreateShortcut.htm"],
pt_br: ["arquivo de atalho","commands/FileCreateShortcut.htm"],

source: ["size of a file/folder","commands/FileGetSize.htm"],
pt_br: ["tamanho de um arquivo/pasta","commands/FileGetSize.htm"],

source: ["size of a window","commands/WinGetPos.htm"],
pt_br: ["tamanho de uma janela","commands/WinGetPos.htm"],

source: ["speed of a script","commands/SetBatchLines.htm"],
pt_br: ["velocidade de um script","commands/SetBatchLines.htm"],
